app/controllers/notes_controller.rb

SELECT * FROM `notes`
---
  def index
    @notes = Note.all

SELECT * FROM `notes` WHERE (`notes`.`id` = 1)
---
  def show
    @note = Note.find(params[:id])

SELECT * FROM `notes` WHERE (`notes`.`id` = 12)
---
  def find_by_date
    @note = Note.find(:all, :conditions => {:date => ("2010-07-10")})

INSERT INTO `notes` (`today`, `created_at`, `yesterday`, `updated_at`, `date`, `issues`, `person_id`) VALUES('Some notes about today', '2010-07-11 19:26:00', 'Some notes about yesterday', '2010-07-11 19:26:00', '2010-07-11', 'No issues', 1)
---
  def create
    @note = Note.new(params[:note])
    if @note.save

UPDATE `notes` SET `updated_at` = '2010-07-18 17:48:19', `person_id` = 1 WHERE `id` = 9
---
  def update
    @note = Note.find(params[:id])
    if @note.update_attributes(params[:note])

DELETE FROM `notes` WHERE `id` = 12
---
  def destroy
    @note = Note.find(params[:id])
    @note.destroy